wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
        /* configure the autoreload value */
        TIMER_CAR(timer_periph) = (uint32_t)initpara->period;

    
        /* configure the clock division value */
        if((TIMER5 != timer_periph) && (TIMER6 != timer_periph)){
            /* reset the CKDIV bit */
            TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_CKDIV;
            TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->clockdivision & TIMER_CTL0_CKDIV);
        }
    
        /* configure the repetition counter value */
        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) || (TIMER15 == timer_periph)|| (TIMER16 == timer_periph)){
            TIMER_CREP0(timer_periph) = (uint32_t)initpara->repetitioncounter;
        }
    
        /* generate an update event */
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      enable a TIMER (API_ID(0x0004U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[out] none
    \retval     none
*/
void timer_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_CEN;
}

/*!
    \brief      disable a TIMER (API_ID(0x0005U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[out] none
    \retval     none
*/
void timer_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CEN);
}

/*!
    \brief      enable the auto reload shadow function (API_ID(0x0006U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_ARSE;
}

/*!
    \brief      disable the auto reload shadow function (API_ID(0x0007U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_ARSE);
}

/*!
    \brief      enable the update event (API_ID(0x0008U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[out] none
    \retval     none
*/
void timer_update_event_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPDIS);
}

/*!
    \brief      disable the update event (API_ID(0x0009U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[out] none
    \retval     none
*/
void timer_update_event_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t) TIMER_CTL0_UPDIS;
}

/*!
    \brief      set TIMER counter alignment mode (API_ID(0x000AU))
    \param[in]  timer_periph: TIMERx(x=0..4,7,15,16)
    \param[in]  aligned:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_COUNTER_EDGE: edge-aligned mode
      \arg        TIMER_COUNTER_CENTER_DOWN: center-aligned and counting down assert mode
      \arg        TIMER_COUNTER_CENTER_UP: center-aligned and counting up assert mode
      \arg        TIMER_COUNTER_CENTER_BOTH: center-aligned and counting up/down assert mode
    \param[out] none
    \retval     none
*/
void timer_counter_alignment(uint32_t timer_periph, uint16_t aligned)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CAM);
    TIMER_CTL0(timer_periph) |= ((uint32_t)aligned & TIMER_CTL0_CAM);
}

/*!
    \brief      set TIMER counter up direction (API_ID(0x000BU))
    \param[in]  timer_periph: TIMERx(x=0..4,7,15,16)
    \param[out] none
    \retval     none
*/
void timer_counter_up_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_DIR);
}

/*!
    \brief      set TIMER counter down direction  (API_ID(0x000CU))
    \param[in]  timer_periph: TIMERx(x=0..4,7,15,16)
    \param[out] none
    \retval     none
*/
void timer_counter_down_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_DIR;
}

/*!
    \brief      configure TIMER prescaler  (API_ID(0x000DU))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[in]  prescaler: prescaler value,0~65535
    \param[in]  pscreload: prescaler reload mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PSC_RELOAD_NOW: the prescaler is loaded right now
      \arg        TIMER_PSC_RELOAD_UPDATE: the prescaler is loaded at the next update event
    \param[out] none
    \retval     none
*/
void timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint8_t pscreload)
{
    TIMER_PSC(timer_periph) = (uint32_t)prescaler;
    
    if(TIMER_PSC_RELOAD_NOW == pscreload){
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      configure TIMER repetition register value (API_ID(0x000EU))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  repetition: the counter repetition value,0~255
    \param[out] none
    \retval     none
*/
void timer_repetition_value_config(uint32_t timer_periph, uint16_t repetition)
{
    TIMER_CREP0(timer_periph) = (uint32_t)repetition;
} 

/*!
    \brief      read TIMER runtime repetition register value (API_ID(0x000FU))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[out] none
    \retval     counter repetition value in TIMER_CREP0 register, 0~0xFF
*/
uint32_t timer_runtime_repetition_value_read(uint32_t timer_periph)
{
    return (uint32_t)(TIMER_CREP0(timer_periph));
}

/*!
    \brief      configure TIMER autoreload register value  (API_ID(0x0010U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[in]  autoreload: the counter auto-reload value, 0~0xFFFF, TIMERx(x=0,2,3,4,5,6,7,15,16)
                                                           0~0xFFFFFFFF, TIMERx(x=1)
    \param[out] none
    \retval     none
*/
void timer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload)
{
    /* configure other TIMER autoreload register value (32-bit or 16-bit) */
    TIMER_CAR(timer_periph) = (uint32_t)autoreload;
}

/*!
    \brief      get TIMER autoreload register value (API_ID(0x0011U))
    \param[in]  timer_periph: TIMERx(x=0~7,15,16)
    \param[out] none
    \retval     counter auto reload register value, 0~0xFFFF, TIMERx(x=0,2,3,4,5,6,7,15,16)
                                                    0~0xFFFFFFFF, TIMERx(x=1)
*/
uint32_t timer_autoreload_value_read(uint32_t timer_periph)
{
    return (uint32_t)(TIMER_CAR(timer_periph));
}

/*!
    \brief      configure TIMER counter register value (API_ID(0x0012U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[in]  counter: the counter value: 0~0xFFFF, TIMERx(x=0,2,3,4,5,6,7,15,16)
                                            0~0xFFFFFFFF, TIMERx(x=1)
    \param[out] none
    \retval     none
*/         
void timer_counter_value_config(uint32_t timer_periph, uint32_t counter)
{
    TIMER_CNT(timer_periph) = (uint32_t)counter;
}

/*!
    \brief      read TIMER counter value (API_ID(0x0013U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[out] none
    \retval     counter value: 0~0xFFFF, TIMERx(x=0,2,3,4,5,6,7,15,16)
                               0~0xFFFFFFFF, TIMERx(x=1)
*/
uint32_t timer_counter_read(uint32_t timer_periph)
{
    return (uint32_t)(TIMER_CNT(timer_periph));
}

/*!
    \brief      read TIMER prescaler value (API_ID(0x0014U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[out] none
    \retval     prescaler register value
*/         
uint16_t timer_prescaler_read(uint32_t timer_periph)
{
    uint16_t prescaler_value = 0U;
    prescaler_value = (uint16_t)(TIMER_PSC(timer_periph));
    return (prescaler_value);
}

/*!
    \brief      configure TIMER single pulse mode (API_ID(0x0015U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[in]  spmode:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SP_MODE_SINGLE: single pulse mode
      \arg        TIMER_SP_MODE_REPETITIVE: repetitive pulse mode
    \param[out] none
    \retval     none
*/
void timer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode)
{
    if(TIMER_SP_MODE_SINGLE == spmode){
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_SPM;
    }else if(TIMER_SP_MODE_REPETITIVE == spmode){
        TIMER_CTL0(timer_periph) &= ~((uint32_t)TIMER_CTL0_SPM);
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      configure TIMER update source (API_ID(0x0016U))
    \param[in]  timer_periph: TIMERx(x=0..7,15,16)
    \param[in]  update: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATE_SRC_GLOBAL: update generate by setting of UPG bit or the counter overflow/underflow,
                                           or the slave mode controller trigger
      \arg        TIMER_UPDATE_SRC_REGULAR: update generate only by counter overflow/underflow
    \param[out] none
    \retval     none
*/
void timer_update_source_config(uint32_t timer_periph, uint32_t update)
{
    if(TIMER_UPDATE_SRC_REGULAR == update){
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPS;
    }else if(TIMER_UPDATE_SRC_GLOBAL == update){
        TIMER_CTL0(timer_periph) &= ~(uint32_t)TIMER_CTL0_UPS;
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      enable the TIMER DMA (API_ID(0x0017U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  dma: specify which DMA to enable
                only one parameter can be selected which is shown as below:
      \arg        TIMER_DMA_UPD:  update DMA enable,TIMERx(x=0,7,1,2,3,4,5,6,15,16)
      \arg        TIMER_DMA_CH0D: channel 0 DMA enable,TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_DMA_CH1D: channel 1 DMA enable,TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_DMA_CH2D: channel 2 DMA enable,TIMERx(x=0,7,1,2,3,4)
      \arg        TIMER_DMA_CH3D: channel 3 DMA enable,TIMERx(x=0,7,1,2,3,4)
      \arg        TIMER_DMA_CMTD: commutation DMA request enable,TIMERx(x=0,7,15,16)
      \arg        TIMER_DMA_TRGD: trigger DMA enable,TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_DMA_MCH0D: multi mode channel 0 DMA request, TIMERx(x=15,16)
    \param[out] none
    \retval     none
*/
void timer_dma_enable(uint32_t timer_periph, uint32_t dma)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t)(dma & TIMER_DMA_MASK);
}

/*!
    \brief      disable the TIMER DMA (API_ID(0x0018U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  dma: specify which DMA to enable
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_DMA_UPD:  update DMA enable,TIMERx(x=0,7,1,2,3,4,5,6,15,16)
      \arg        TIMER_DMA_CH0D: channel 0 DMA enable,TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_DMA_CH1D: channel 1 DMA enable,TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_DMA_CH2D: channel 2 DMA enable,TIMERx(x=0,7,1,2,3,4)
      \arg        TIMER_DMA_CH3D: channel 3 DMA enable,TIMERx(x=0,7,1,2,3,4)
      \arg        TIMER_DMA_CMTD: commutation DMA request enable,TIMERx(x=0,7,15,16)
      \arg        TIMER_DMA_TRGD: trigger DMA enable,TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_DMA_MCH0D: multi mode channel 0 DMA request, TIMERx(x=15,16)
    \param[out] none
    \retval     none
*/
void timer_dma_disable(uint32_t timer_periph, uint32_t dma)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(dma & TIMER_DMA_MASK)); 
}

/*!
    \brief      channel DMA request source selection (API_ID(0x0019U))
    \param[in]  timer_periph: TIMERx(x=0..4,7,15,16)
    \param[in]  dma_request: channel DMA request source selection
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMAREQUEST_CHANNELEVENT: DMA request of channel y is sent when channel y event occurs
       \arg        TIMER_DMAREQUEST_UPDATEEVENT: DMA request of channel y is sent when update event occurs 
    \param[out] none
    \retval     none
*/
void timer_channel_dma_request_source_select(uint32_t timer_periph, uint8_t dma_request)
{
    if(TIMER_DMAREQUEST_UPDATEEVENT == dma_request){
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_DMAS;
    }else if(TIMER_DMAREQUEST_CHANNELEVENT == dma_request){
        TIMER_CTL1(timer_periph) &= ~(uint32_t)TIMER_CTL1_DMAS;
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      configure the TIMER DMA transfer (API_ID(0x001AU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  dma_baseaddr:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMACFG_DMATA_CTL0: DMA transfer address is TIMER_CTL0, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_CTL1: DMA transfer address is TIMER_CTL1, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_SMCFG: DMA transfer address is TIMER_SMCFG, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_DMAINTEN: DMA transfer address is TIMER_DMAINTEN, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_INTF: DMA transfer address is TIMER_INTF, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_SWEVG: DMA transfer address is TIMER_SWEVG, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_CHCTL0: DMA transfer address is TIMER_CHCTL0, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_CHCTL1: DMA transfer address is TIMER_CHCTL1, TIMERx(x=0,7,1,2,3,4)
       \arg        TIMER_DMACFG_DMATA_CHCTL2: DMA transfer address is TIMER_CHCTL2, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_CNT: DMA transfer address is TIMER_CNT, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_PSC: DMA transfer address is TIMER_PSC, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_CAR: DMA transfer address is TIMER_CAR, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_CREP0: DMA transfer address is TIMER_CREP0, TIMERx(x=0,7,15,16)
       \arg        TIMER_DMACFG_DMATA_CH0CV: DMA transfer address is TIMER_CH0CV, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_CH1CV: DMA transfer address is TIMER_CH1CV, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_CH2CV: DMA transfer address is TIMER_CH2CV, TIMERx(x=0,7,1,2,3,4)
       \arg        TIMER_DMACFG_DMATA_CH3CV: DMA transfer address is TIMER_CH3CV, TIMERx(x=0,7,1,2,3,4)
       \arg        TIMER_DMACFG_DMATA_CCHP0: DMA transfer address is TIMER_CCHP0, TIMERx(x=0,7,15,16)
       \arg        TIMER_DMACFG_DMATA_MCHCTL0: DMA transfer address is TIMER_MCHCTL0, TIMERx(x=15,16)
       \arg        TIMER_DMACFG_DMATA_MCHCTL2: DMA transfer address is TIMER_MCHCTL2, TIMERx(x=15,16)
       \arg        TIMER_DMACFG_DMATA_MCH0CV: DMA transfer address is TIMER_MCH0CV, TIMERx(x=15,16)
       \arg        TIMER_DMACFG_DMATA_CH0COMV_ADD: DMA transfer address is TIMER_CH0COMV_ADD, TIMERx(x=0,7,15,16)
       \arg        TIMER_DMACFG_DMATA_CH1COMV_ADD: DMA transfer address is TIMER_CH1COMV_ADD, TIMERx(x=0,7,15,16)
       \arg        TIMER_DMACFG_DMATA_CH2COMV_ADD: DMA transfer address is TIMER_CH2COMV_ADD, TIMERx(x=0,7)
       \arg        TIMER_DMACFG_DMATA_CH3COMV_ADD: DMA transfer address is TIMER_CH3COMV_ADD, TIMERx(x=0,7)
       \arg        TIMER_DMACFG_DMATA_CTL2: DMA transfer address is TIMER_CTL2, TIMERx(x=0,7,1,2,3,4,15,16)
       \arg        TIMER_DMACFG_DMATA_AFCTL0: DMA transfer address is TIMER_AFCTL0, TIMERx(x=0,7,15,16)
       \arg        TIMER_DMACFG_DMATA_CCHP1: DMA transfer address is TIMER_CCHP1, TIMERx(x=0,7)
       \arg        TIMER_DMACFG_DMATA_WDGPER: DMA transfer address is TIMER_WDGPER, TIMERx(x=1,2,3,4)
       \arg        TIMER_DMACFG_DMATA_CINITCTL: DMA transfer address is TIMER_CINITCTL, TIMERx(x=0,7,15,16)
       \arg        TIMER_DMACFG_DMATA_CINITV: DMA transfer address is TIMER_CINITV, TIMERx(x=0,7,15,16)
       \arg        TIMER_DMACFG_DMATA_CHBRKCTL: DMA transfer address is TIMER_CHBRKCTL, TIMERx(x=0,7)
       \arg        TIMER_DMACFG_DMATA_CHBRKPER: DMA transfer address is TIMER_CHBRKPER, TIMERx(x=0,7)
       \arg        TIMER_DMACFG_DMATA_CHBRKINTF: DMA transfer address is TIMER_CHBRKINTF, TIMERx(x=0,7)
    \param[in]  dma_lenth:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMACFG_DMATC_xTRANSFER(x=1..38): DMA transfer x time
    \param[out] none
    \retval     none
*/
void timer_dma_transfer_config(uint32_t timer_periph, uint32_t dma_baseaddr, uint32_t dma_lenth)
{
    TIMER_DMACFG(timer_periph) &= (~(uint32_t)(TIMER_DMACFG_DMATA | TIMER_DMACFG_DMATC));
    TIMER_DMACFG(timer_periph) |= (uint32_t)((dma_baseaddr & TIMER_DMACFG_DMATA) | (dma_lenth & TIMER_DMACFG_DMATC));
}

/*!
    \brief      software generate events (API_ID(0x001BU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  event: the timer software event generation sources
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_EVENT_SRC_UPG: update event generation, TIMERx(x=0,7,1,2,3,4,5,6,15,16)
      \arg        TIMER_EVENT_SRC_CH0G: channel 0 capture or compare event generation, TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_EVENT_SRC_CH1G: channel 1 capture or compare event generation, TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_EVENT_SRC_CH2G: channel 2 capture or compare event generation, TIMERx(x=0,7,1,2,3,4)
      \arg        TIMER_EVENT_SRC_CH3G: channel 3 capture or compare event generation, TIMERx(x=0,7,1,2,3,4)
      \arg        TIMER_EVENT_SRC_CMTG: channel commutation event generation, TIMERx(x=0,7,15,16)
      \arg        TIMER_EVENT_SRC_TRGG: trigger event generation, TIMERx(x=0,7,1,2,3,4,15,16)
      \arg        TIMER_EVENT_SRC_BRKG: BREAK event generation, TIMERx(x=0,7,15,16)
      \arg        TIMER_EVENT_SRC_MCH0G: multi mode channel 0 capture or compare event generation, TIMERx(x=15,16)
      \arg        TIMER_EVENT_SRC_CH0COMADDG: channel 0 additional compare event generation, TIMERx(x=0,7,15,16)
      \arg        TIMER_EVENT_SRC_CH1COMADDG: channel 1 additional compare event generation, TIMERx(x=0,7,15,16)
      \arg        TIMER_EVENT_SRC_CH2COMADDG: channel 2 additional compare event generation, TIMERx(x=0,7)
      \arg        TIMER_EVENT_SRC_CH3COMADDG: channel 3 additional compare event generation, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_event_software_generate(uint32_t timer_periph, uint32_t event)
{
    TIMER_SWEVG(timer_periph) |= (uint32_t)event;
}

/*!
    \brief      initialize TIMER break parameter struct with a default value (API_ID(0x001CU))
    \param[in]  breakpara: TIMER break parameter struct
    \param[out] none
    \retval     none
*/
void timer_break_struct_para_init(timer_break_parameter_struct* breakpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(breakpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the break parameter struct member with the default value */
        breakpara->runoffstate           = TIMER_ROS_STATE_DISABLE;
        breakpara->ideloffstate          = TIMER_IOS_STATE_DISABLE;
        breakpara->deadtime              = 0U;
        breakpara->outputautostate       = TIMER_OUTAUTO_DISABLE;
        breakpara->protectmode           = TIMER_CCHP0_PROT_OFF;
        breakpara->breakstate           = TIMER_BREAK_DISABLE;
        breakpara->breakfilter          = 0U;
        breakpara->breakpolarity        = TIMER_BREAK_POLARITY_LOW;
    }
}

/*!
    \brief      configure TIMER break function (API_ID(0x001DU))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  breakpara: TIMER break parameter struct
                  runoffstate: TIMER_ROS_STATE_ENABLE, TIMER_ROS_STATE_DISABLE
                  ideloffstate: TIMER_IOS_STATE_ENABLE, TIMER_IOS_STATE_DISABLE
                  deadtime: 0~255
                  outputautostate: TIMER_OUTAUTO_ENABLE, TIMER_OUTAUTO_DISABLE
                  protectmode: TIMER_CCHP0_PROT_OFF, TIMER_CCHP0_PROT_0, TIMER_CCHP0_PROT_1, TIMER_CCHP0_PROT_2
                  breakstate: TIMER_BREAK_ENABLE, TIMER_BREAK_DISABLE
                  breakfilter: 0~15
                  breakpolarity: TIMER_BREAK_POLARITY_LOW, TIMER_BREAK_POLARITY_HIGH
    \param[out] none
    \retval     none
*/
void timer_break_config(uint32_t timer_periph, timer_break_parameter_struct* breakpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(breakpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) || (TIMER15 == timer_periph) || (TIMER16 == timer_periph)) {
            TIMER_CCHP0(timer_periph) = (uint32_t)(((uint32_t)(breakpara->runoffstate & TIMER_CCHP0_ROS)) |
                                                ((uint32_t)(breakpara->ideloffstate & TIMER_CCHP0_IOS)) |
                                                ((uint32_t)(breakpara->deadtime & TIMER_CCHP0_DTCFG)) |
                                                ((uint32_t)(breakpara->outputautostate & TIMER_CCHP0_OAEN)) |
                                                ((uint32_t)(breakpara->protectmode & TIMER_CCHP0_PROT)) |
                                                ((uint32_t)(breakpara->breakstate & TIMER_CCHP0_BRKEN)) |
                                                (((uint32_t)(breakpara->breakfilter) << 16U) & TIMER_CCHP0_BRKF) |
                                                ((uint32_t)(breakpara->breakpolarity & TIMER_CCHP0_BRKP)));
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      enable TIMER break function (API_ID(0x001EU))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[out] none
    \retval     none
*/
void timer_break_enable(uint32_t timer_periph)
{
    TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_BRKEN;
}

/*!
    \brief      disable TIMER break function (API_ID(0x001FU))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[out] none
    \retval     none
*/
void timer_break_disable(uint32_t timer_periph)
{
    TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_BRKEN);
}

/*!
    \brief      enable TIMER output automatic function (API_ID(0x0020U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_enable(uint32_t timer_periph)
{
    TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_OAEN;
}

/*!
    \brief      disable TIMER output automatic function (API_ID(0x0021U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_disable(uint32_t timer_periph)
{
    TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_OAEN);
}

/*!
    \brief      configure TIMER primary output function (API_ID(0x0022U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_primary_output_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue){
        TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_POEN;
    }else{
        TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_POEN);
    }
}

/*!
    \brief      enable or disable channel capture/compare control shadow register (API_ID(0x0023U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  newvalue: ENABLE or DISABLE 
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue)
{
     if(ENABLE == newvalue){
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCSE;
    }else{
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCSE);
    }
}

