wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
        if((TIMER15 == timer_periph) || (TIMER16 == timer_periph)) {
            /* reset the MCH1P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1P);
            /* set the MCH1P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnpolarity) << 4U) & TIMER_CHCTL2_MCH1P);
            /* reset the ISO1 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
            /* set the ISO1 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocidlestate) << 2U) & TIMER_CTL1_ISO1);
        }

        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) || (TIMER1 == timer_periph) || (TIMER2 == timer_periph) || \
           (TIMER3 == timer_periph) || (TIMER4 == timer_periph)){
            /* reset the CH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
            /* set the CH2EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputstate) << 8U) & TIMER_CHCTL2_CH2EN);
            /* reset the CH2P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2P);
            /* set the CH2P bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocpolarity) << 8U) & TIMER_CHCTL2_CH2P);
        }
        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph)) {
            /* reset the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2NEN);
            /* set the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputnstate) << 8U) & TIMER_CHCTL2_CH2NEN);
            /* reset the MCH2P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2NP);
            /* set the MCH2P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnpolarity) << 8U) & TIMER_CHCTL2_CH2NP);
            /* reset the ISO2 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2);
            /* set the ISO2 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocidlestate) << 4U) & TIMER_CTL1_ISO2);
            /* reset the ISO2N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2N);
            /* set the ISO2N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnidlestate) << 4U) & TIMER_CTL1_ISO2N);
        }

        if((TIMER1 == timer_periph) || (TIMER2 == timer_periph) || (TIMER3 == timer_periph) || (TIMER4 == timer_periph)){
            /* reset the CH2NP bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2NP);
            /* set the CH2NP bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnpolarity) << 8U) & TIMER_CHCTL2_CH2NP);
        }
    
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2MS);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) || (TIMER1 == timer_periph) || (TIMER2 == timer_periph) || \
           (TIMER3 == timer_periph) || (TIMER4 == timer_periph)){
            /* reset the CH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
            /* set the CH3EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputstate) << 12U) & TIMER_CHCTL2_CH3EN);
            /* reset the CH3P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3P);
            /* set the CH3P bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocpolarity) << 12U) & TIMER_CHCTL2_CH3P);
        }
        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph)) {
            /* reset the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3NEN);
            /* set the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->outputnstate) << 12U) & TIMER_CHCTL2_CH3NEN);
            /* reset the MCH3P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3NP);
            /* set the MCH3P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnpolarity) << 12U) & TIMER_CHCTL2_CH3NP);
            /* reset the ISO3 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3);
            /* set the ISO3 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocidlestate) << 6U) & TIMER_CTL1_ISO3);
            /* reset the ISO3N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3N);
            /* set the ISO3N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnidlestate) << 6U) & TIMER_CTL1_ISO3N);
        }

        if((TIMER1 == timer_periph) || (TIMER2 == timer_periph) || (TIMER3 == timer_periph) || (TIMER4 == timer_periph)){
            /* reset the CH3NP bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3NP);
            /* set the CH3NP bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(ocpara->ocnpolarity) << 12U) & TIMER_CHCTL2_CH3NP);
        }

        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3MS);
        break;
     default:
        break;
    }
    }
}

/*!
    \brief      configure TIMER channel output compare mode (API_ID(0x0027U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  ocmode: channel output compare mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_MODE_TIMING: timing mode
      \arg        TIMER_OC_MODE_ACTIVE: active mode
      \arg        TIMER_OC_MODE_INACTIVE: inactive mode
      \arg        TIMER_OC_MODE_TOGGLE: toggle mode
      \arg        TIMER_OC_MODE_LOW: force low mode
      \arg        TIMER_OC_MODE_HIGH: force high mode
      \arg        TIMER_OC_MODE_PWM0: PWM0 mode
      \arg        TIMER_OC_MODE_PWM1: PWM1 mode
      \arg        TIMER_OC_MODE_ASYMMETRIC_PWM0: asymmetric PWM mode 0 (TIMERx(x=0,7))
      \arg        TIMER_OC_MODE_ASYMMETRIC_PWM1: asymmetric PWM mode 1 (TIMERx(x=0,7))
    \param[out] none
    \retval     none
*/
void timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t ocmode)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCTL);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(ocmode & TIMER_CHCTL0_CH0COMCTL);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCTL);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_CHCTL0_CH1COMCTL);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCTL);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(ocmode & TIMER_CHCTL1_CH2COMCTL);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCTL);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocmode) << 8U) & TIMER_CHCTL1_CH3COMCTL);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMCTL);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(ocmode & TIMER_MCHCTL0_MCH0COMCTL);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output pulse value (API_ID(0x0028U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  pulse: channel output pulse value
    \param[out] none
    \retval     none
*/
void timer_channel_output_pulse_value_config(uint32_t timer_periph, uint16_t channel, uint32_t pulse)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CH0CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CH1CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CH2CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CH3CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCH0CV(timer_periph) = (uint32_t)pulse;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output shadow function (API_ID(0x0029U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  ocshadow: channel output shadow state
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_SHADOW_ENABLE: channel output shadow state enable
      \arg        TIMER_OC_SHADOW_DISABLE: channel output shadow state disable
      \arg        TIMER_OMC_SHADOW_ENABLE: multi mode channel output compare shadow enable
      \arg        TIMER_OMC_SHADOW_DISABLE: multi mode channel output compare shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow)
{
    switch(channel){
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMSEN);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)ocshadow & TIMER_CHCTL0_CH0COMSEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_CHCTL0_CH1COMSEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMSEN);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)ocshadow & TIMER_CHCTL1_CH2COMSEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 8U) & TIMER_CHCTL1_CH3COMSEN);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMSEN);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)ocshadow & TIMER_MCHCTL0_MCH0COMSEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output fast function (API_ID(0x002AU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0..4,7))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0..4,7))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  ocfast: channel output fast function
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_FAST_ENABLE: channel output compare fast function enable
      \arg        TIMER_OC_FAST_DISABLE: channel output compare fast function disable
      \arg        TIMER_OMC_FAST_ENABLE: multi mode channel output compare fast function enable
      \arg        TIMER_OMC_FAST_DISABLE: multi mode channel output compare fast function disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_compare_fast_config(uint32_t timer_periph, uint16_t channel, uint16_t ocfast)
{
    switch(channel){
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMFEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(ocfast & TIMER_CHCTL0_CH0COMFEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMFEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)ocfast << 8U) & TIMER_CHCTL0_CH1COMFEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMFEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(ocfast & TIMER_CHCTL1_CH2COMFEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMFEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)ocfast << 8U) & TIMER_CHCTL1_CH3COMFEN);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMFEN);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)(ocfast & TIMER_MCHCTL0_MCH0COMFEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output clear function (API_ID(0x002BU))
    \param[in]  timer_periph: TIMERx(x=0,7,1,2,3,4)
    \param[in]  channel: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7,1,2,3,4))
    \param[in]  occlear: channel output clear function
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_CLEAR_ENABLE: channel output clear function enable
      \arg        TIMER_OC_CLEAR_DISABLE: channel output clear function disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_clear_config(uint32_t timer_periph, uint16_t channel, uint16_t occlear)
{
    switch(channel){
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCEN);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)occlear & TIMER_CHCTL0_CH0COMCEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_CHCTL0_CH1COMCEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCEN);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)occlear & TIMER_CHCTL1_CH2COMCEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)occlear << 8U) & TIMER_CHCTL1_CH3COMCEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output polarity (API_ID(0x002CU))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  ocpolarity: channel output polarity 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_POLARITY_HIGH: channel output polarity is high
      \arg        TIMER_OC_POLARITY_LOW: channel output polarity is low
      \arg        TIMER_OMC_POLARITY_HIGH: multi mode channel output polarity is high
      \arg        TIMER_OMC_POLARITY_LOW: multi mode channel output polarity is low
    \param[out] none
    \retval     none
*/
void timer_channel_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocpolarity)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0P);
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ocpolarity & TIMER_CHCTL2_CH0P);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 4U) & TIMER_CHCTL2_CH1P);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 8U) & TIMER_CHCTL2_CH2P);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3P);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocpolarity << 12U) & TIMER_CHCTL2_CH3P);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH0FP);
        TIMER_MCHCTL2(timer_periph) |= ((uint32_t)ocpolarity & TIMER_MCHCTL2_MCH0FP);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel complementary output polarity (API_ID(0x002DU))
    \param[in]  timer_periph: TIMERx(x=0,7,1,2,3,4,15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7,1,2,3,4))
    \param[in]  ocnpolarity: channel complementary output polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OCN_POLARITY_HIGH: channel complementary output polarity is high
      \arg        TIMER_OCN_POLARITY_LOW: channel complementary output polarity is low
    \param[out] none
    \retval     none
*/
void timer_channel_complementary_output_polarity_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnpolarity)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0NP);
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ocnpolarity & TIMER_CHCTL2_CH0NP);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1NP);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnpolarity << 4U) & TIMER_CHCTL2_CH1NP);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2NP);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnpolarity << 8U) & TIMER_CHCTL2_CH2NP);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3NP);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnpolarity << 12U) & TIMER_CHCTL2_CH3NP);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel enable state (API_ID(0x002EU))
    \param[in]  timer_periph: TIMERx(x=0,7,1,2,3,4,15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  state: TIMER channel enable state
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CCX_ENABLE: channel enable
      \arg        TIMER_CCX_DISABLE: channel disable
      \arg        TIMER_MCCX_ENABLE: multi mode channel enable
      \arg        TIMER_MCCX_DISABLE: multi mode channel disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_state_config(uint32_t timer_periph, uint16_t channel, uint32_t state)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(state & TIMER_CHCTL2_CH0EN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)state << 4U) & TIMER_CHCTL2_CH1EN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)state << 8U) & TIMER_CHCTL2_CH2EN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)state << 12U) & TIMER_CHCTL2_CH3EN);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)state) & TIMER_CHCTL2_MCH0EN);
        break;
    default:
        break;
    }
}

