wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
/*!
    \brief      configure TIMER channel complementary output enable state (API_ID(0x002FU))
    \param[in]  timer_periph: TIMERx(x=0,7,1,2,3,4,15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7,1,2,3,4))
    \param[in]  ocnstate: TIMER channel complementary output enable state
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CCXN_ENABLE: channel complementary enable
      \arg        TIMER_CCXN_DISABLE: channel complementary disable
    \param[out] none
    \retval     none
*/
void timer_channel_complementary_output_state_config(uint32_t timer_periph, uint16_t channel, uint16_t ocnstate)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0NEN);
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)ocnstate & TIMER_CHCTL2_CH0NEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1NEN);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnstate << 4U) & TIMER_CHCTL2_CH1NEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2NEN);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnstate << 8U) & TIMER_CHCTL2_CH2NEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3NEN);
        TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)ocnstate << 12U) & TIMER_CHCTL2_CH3NEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel period point match moment OxCPRE level in the composite PWM or asymmetric PWM mode (API_ID(0x0030U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_composite_asymmetric_pwm_level_config(uint32_t timer_periph, uint16_t channel, ControlStatus newvalue)
{
    switch(channel) {
    case TIMER_CH_0:
        if(ENABLE == newvalue) {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0PERFOREN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0PERFOREN;
        } else {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0PERFOREN);
        }
        break;
    case TIMER_CH_1:
        if(ENABLE == newvalue) {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1PERFOREN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1PERFOREN;
        } else {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1PERFOREN);
        }
        break;
    case TIMER_CH_2:
        if(ENABLE == newvalue) {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2PERFOREN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH2PERFOREN;
        } else {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2PERFOREN);
        }
        break;
    case TIMER_CH_3:
        if(ENABLE == newvalue) {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3PERFOREN);
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH3PERFOREN;
        } else {
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3PERFOREN);
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      output clear invalid event selection (API_ID(0x0031U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  event:
                only one parameter can be selected which is shown as below:
       \arg       TIMER_OCREFCLR_INVALID_FLOW: output clear invalid by next overflow or underflow event
       \arg       TIMER_OCREFCLR_INVALID_UPDATE: ouput clear invalid by next update event
    \param[out] none
    \retval     none
*/
void timer_channel_output_clear_invalid_selection(uint32_t timer_periph, uint32_t event)
{
    if(TIMER_OCREFCLR_INVALID_UPDATE == event)
    {
        TIMER_CFG(timer_periph) |= TIMER_CFG_OCPRECIVM;
    } else {
        TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_OCPRECIVM);
    }
}

/*!
    \brief      initialize TIMER channel input parameter struct with a default value (API_ID(0x0032U))
    \param[in]  icpara: TIMER channel intput parameter struct
    \param[out] none
    \retval     none
*/
void timer_channel_input_struct_para_init(timer_ic_parameter_struct* icpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(icpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0032U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel input parameter struct member with the default value */
        icpara->icpolarity  = TIMER_IC_POLARITY_RISING;
        icpara->icselection = TIMER_IC_SELECTION_DIRECTTI;
        icpara->icprescaler = TIMER_IC_PSC_DIV1;
        icpara->icfilter    = 0U;
        }
}

/*!
    \brief      configure TIMER input capture parameter (API_ID(0x0033U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  icpara: TIMER channel input parameter struct
                  icpolarity: TIMER_IC_POLARITY_RISING, TIMER_IC_POLARITY_FALLING, TIMER_IC_POLARITY_BOTH_EDGE
                  icselection: TIMER_IC_SELECTION_DIRECTTI, TIMER_IC_SELECTION_INDIRECTTI, TIMER_IC_SELECTION_ITS
                  icprescaler: TIMER_IC_PSC_DIV1, TIMER_IC_PSC_DIV2, TIMER_IC_PSC_DIV4, TIMER_IC_PSC_DIV8
                  icfilter: 0~15
    \param[out] none
    \retval     none
*/
void timer_input_capture_config(uint32_t timer_periph, uint16_t channel, timer_ic_parameter_struct *icpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(icpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0033U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
    
