wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
            /* reset the CH0P and MCH0P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(icpara->icpolarity) & (TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
    
            /* reset the CH0MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            TIMER_CHCTL0(timer_periph) |= ((uint32_t)(icpara->icselection) & TIMER_CHCTL0_CH0MS);
    
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icfilter) << 4U) & TIMER_CHCTL0_CH0CAPFLT);
    
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
            break;
    
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
    
            /* reset the CH1P and MCH1P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icpolarity) << 4U) & (TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
    
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icselection) << 8U) & TIMER_CHCTL0_CH1MS);
    
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icfilter) << 12U) & TIMER_CHCTL0_CH1CAPFLT);
    
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
            break;
    
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            /* reset the CH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
    
            /* reset the CH2P and MCH2P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH2P | TIMER_CHCTL2_CH2NP));
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icpolarity) << 8U) & (TIMER_CHCTL2_CH2P | TIMER_CHCTL2_CH2NP));
    
            /* reset the CH2MS bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2MS);
            TIMER_CHCTL1(timer_periph) |= ((uint32_t)(icpara->icselection) & TIMER_CHCTL1_CH2MS);
    
            /* reset the CH2CAPFLT bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2CAPFLT);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icfilter) << 4U) & TIMER_CHCTL1_CH2CAPFLT);
    
            /* set the CH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH2EN;
            break;
    
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            /* reset the CH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
    
            /* reset the CH3P bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH3P | TIMER_CHCTL2_CH3NP));
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icpolarity) << 12U) & (TIMER_CHCTL2_CH3P | TIMER_CHCTL2_CH3NP));
    
            /* reset the CH3MS bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3MS);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icselection) << 8U) & TIMER_CHCTL1_CH3MS);
    
            /* reset the CH3CAPFLT bit */
            TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3CAPFLT);
            TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icfilter) << 12U) & TIMER_CHCTL1_CH3CAPFLT);
    
            /* set the CH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH3EN;
            break;
    
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            /* reset the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
    
            /* reset the MCH0FP bits */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)(TIMER_MCHCTL2_MCH0FP));
            switch(icpara->icpolarity) {
            case TIMER_IC_POLARITY_RISING:
                TIMER_MCHCTL2(timer_periph) |= TIMER_IMC_POLARITY_RISING;
                break;
            case TIMER_IC_POLARITY_FALLING:
                TIMER_MCHCTL2(timer_periph) |= TIMER_IMC_POLARITY_FALLING;
                break;
            case TIMER_IC_POLARITY_BOTH_EDGE:
                TIMER_MCHCTL2(timer_periph) |= TIMER_IMC_POLARITY_BOTH_EDGE;
                break;
            default:
                break;
            }
    
            /* reset the MCH0MS bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0MS);
            TIMER_MCHCTL0(timer_periph) |= ((uint32_t)(icpara->icselection) & TIMER_MCHCTL0_MCH0MS);
    
            /* reset the MCH0CAPFLT bit */
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0CAPFLT);
            TIMER_MCHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpara->icfilter) << 4U) & TIMER_MCHCTL0_MCH0CAPFLT);
    
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_MCH0EN;
            break;
        default:
            break;
        }
    
        /* configure TIMER channel input capture prescaler value */
        timer_channel_input_capture_prescaler_config(timer_periph, channel, (uint16_t)(icpara->icprescaler));
    }
}

/*!
    \brief      configure TIMER channel input capture prescaler value (API_ID(0x0034U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  prescaler: channel input capture prescaler value
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_PSC_DIV1: no prescaler
      \arg        TIMER_IC_PSC_DIV2: divided by 2
      \arg        TIMER_IC_PSC_DIV4: divided by 4
      \arg        TIMER_IC_PSC_DIV8: divided by 8
    \param[out] none
    \retval     none
*/
void timer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint16_t prescaler)
{
    switch(channel){
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPPSC);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)prescaler & TIMER_CHCTL0_CH0CAPPSC);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPPSC);
        TIMER_CHCTL0(timer_periph) |= (((uint32_t)prescaler << 8U) & TIMER_CHCTL0_CH1CAPPSC);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2CAPPSC);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)prescaler & TIMER_CHCTL1_CH2CAPPSC);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3CAPPSC);
        TIMER_CHCTL1(timer_periph) |= (((uint32_t)prescaler << 8U) & TIMER_CHCTL1_CH3CAPPSC);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0CAPPSC);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)prescaler & TIMER_MCHCTL0_MCH0CAPPSC);
        break;
    default:
        break;
    }
}

/*!
    \brief      read TIMER channel capture compare register value (API_ID(0x0035U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[out] none
    \retval     channel capture compare register value
*/
uint32_t timer_channel_capture_value_register_read(uint32_t timer_periph, uint16_t channel)
{
    uint32_t count_value = 0U;

