wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
    switch(channel){
    /* read TIMER channel 0 capture compare register value */
    case TIMER_CH_0:
        /* read TIMER_CH_0 capture compare register value */
        count_value = TIMER_CH0CV(timer_periph);
        break;
    case TIMER_CH_1:
        /* read TIMER_CH_1 capture compare register value */
        count_value = TIMER_CH1CV(timer_periph);
        break;
    case TIMER_CH_2:
        /* read TIMER_CH_2 capture compare register value */
        count_value = TIMER_CH2CV(timer_periph);
        break;
    case TIMER_CH_3:
        /* read TIMER_CH_3 capture compare register value */
        count_value = TIMER_CH3CV(timer_periph);
        break;
    case TIMER_MCH_0:
        /* read TIMER_MCH_0 capture compare register value */
        count_value = TIMER_MCH0CV(timer_periph);
        break;
    default:
        break;
    }
    return (count_value);
}

/*!
    \brief      configure TIMER input pwm capture function (API_ID(0x0036U))
    \param[in]  timer_periph: TIMERx(x=0..4,7)
    \param[in]  channel: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0
      \arg        TIMER_CH_1: TIMER channel1
     \param[in]  icpwm:TIMER channel intput pwm parameter struct
                 icpolarity: TIMER_IC_POLARITY_RISING,TIMER_IC_POLARITY_FALLING
                 icselection: TIMER_IC_SELECTION_DIRECTTI,TIMER_IC_SELECTION_INDIRECTTI
                 icprescaler: TIMER_IC_PSC_DIV1,TIMER_IC_PSC_DIV2,TIMER_IC_PSC_DIV4,TIMER_IC_PSC_DIV8
                 icfilter: 0~15
    \param[out] none
    \retval     none
*/
void timer_input_pwm_capture_config(uint32_t timer_periph, uint16_t channel, timer_ic_parameter_struct* icpwm)
{
    uint16_t icpolarity  = 0x0U;
    uint16_t icselection = 0x0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(icpwm)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0036U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* Set channel input polarity */
        if(TIMER_IC_POLARITY_RISING == icpwm->icpolarity){
            icpolarity = TIMER_IC_POLARITY_FALLING;
        }else{
            icpolarity = TIMER_IC_POLARITY_RISING;
        }
    
        /* Set channel input mode selection */
        if(TIMER_IC_SELECTION_DIRECTTI == icpwm->icselection){
            icselection = TIMER_IC_SELECTION_INDIRECTTI;
        }else{
            icselection = TIMER_IC_SELECTION_DIRECTTI;
        }
    
        if(TIMER_CH_0 == channel){
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* reset the CH0P and CH0NP bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P|TIMER_CHCTL2_CH0NP));
            /* set the CH0P and CH0NP bits */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(icpwm->icpolarity) & (TIMER_CHCTL2_CH0P | TIMER_CHCTL2_MCH0P));
            /* reset the CH0MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            /* set the CH0MS bit */
            TIMER_CHCTL0(timer_periph) |= ((uint32_t)(icpwm->icselection) & TIMER_CHCTL0_CH0MS);
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            /* set the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (((uint32_t)(icpwm->icfilter) << 4U) & TIMER_CHCTL0_CH0CAPFLT);
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph,TIMER_CH_0,(uint16_t)(icpwm->icprescaler));
    
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* reset the CH1P and CH1NP bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P|TIMER_CHCTL2_CH1NP));
            /* set the CH1P and CH1NP bits */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)icpolarity << 4U) & (TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            /* set the CH1MS bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)icselection << 8U) & TIMER_CHCTL0_CH1MS);
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpwm->icfilter) << 12U) & TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph,TIMER_CH_1,(uint16_t)(icpwm->icprescaler));
        }else{
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* reset the CH1P and CH1NP bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH1P|TIMER_CHCTL2_CH1NP));
            /* set the CH1P and CH1NP bits */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(icpwm->icpolarity) << 4U) & (TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
            /* reset the CH1MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            /* set the CH1MS bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpwm->icselection) << 8U) & TIMER_CHCTL0_CH1MS);
            /* reset the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)(icpwm->icfilter) << 12U) & TIMER_CHCTL0_CH1CAPFLT);
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_1, (uint16_t)(icpwm->icprescaler));
    
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* reset the CH0P and CH0NP bits */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)(TIMER_CHCTL2_CH0P|TIMER_CHCTL2_CH0NP));
            /* set the CH0P and CH0NP bits */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)icpolarity & (TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
            /* reset the CH0MS bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            /* set the CH0MS bit */
            TIMER_CHCTL0(timer_periph) |= ((uint32_t)icselection & TIMER_CHCTL0_CH0MS);
            /* reset the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            /* set the CH0CAPFLT bit */
            TIMER_CHCTL0(timer_periph) |= (((uint32_t)(icpwm->icfilter) << 4U) & TIMER_CHCTL0_CH0CAPFLT);
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_0, (uint16_t)(icpwm->icprescaler));
        }
    }
}

/*!
    \brief      configure TIMER hall sensor mode (API_ID(0x0037U))
    \param[in]  timer_periph: TIMERx(x=0,7,1,2,3,4,15,16)
    \param[in]  hallmode: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_HALLINTERFACE_ENABLE: TIMER hall sensor mode enable
      \arg        TIMER_HALLINTERFACE_DISABLE: TIMER hall sensor mode disable
    \param[out] none
    \retval     none
*/
void timer_hall_mode_config(uint32_t timer_periph, uint32_t hallmode)
{
    if(TIMER_HALLINTERFACE_ENABLE == hallmode){
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_TI0S;
    }else if(TIMER_HALLINTERFACE_DISABLE == hallmode){
        TIMER_CTL1(timer_periph) &= ~(uint32_t)TIMER_CTL1_TI0S;
    }else{
        /* illegal parameters */
    }
}

/*!
    \brief      initialize TIMER multi mode channel output parameter struct (API_ID(0x0038U))
    \param[in]  omcpara: TIMER multi mode channel output parameter struct
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_output_parameter_struct_init(timer_omc_parameter_struct *omcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(omcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0038U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the multi mode channel output parameter struct with the default value */
        omcpara->outputmode  = TIMER_MCH_MODE_COMPLEMENTARY;
        omcpara->outputstate = TIMER_MCCX_DISABLE;
        omcpara->ocpolarity  = TIMER_OMC_POLARITY_LOW;
    }
}

/*!
    \brief      configure TIMER multi mode channel output function (API_ID(0x0039U))
    \param[in]  timer_periph: TIMERx(x=15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  omcpara: TIMER multi mode channel output parameter struct
                  outputmode: TIMER_MCH_MODE_INDEPENDENTLY, TIMER_MCH_MODE_COMPLEMENTARY
                  outputstate: TIMER_MCCX_ENABLE, TIMER_MCCX_DISABLE
                  ocpolarity: TIMER_OMC_POLARITY_HIGH, TIMER_OMC_POLARITY_LOW
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_omc_parameter_struct *omcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(omcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0039U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_CTL2(timer_periph) &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << 20U));
            TIMER_CTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputmode) & TIMER_MCH_MODE_MASK) << 20U);
            /* reset the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)(((uint32_t)(omcpara->outputstate)) & TIMER_CHCTL2_MCH0EN);
            /* reset the MCH0FP bit */
            TIMER_MCHCTL2(timer_periph) &= (~(uint32_t)TIMER_MCHCTL2_MCH0FP);
            /* set the MCH0FP bit */
            TIMER_MCHCTL2(timer_periph) |= ((uint32_t)omcpara->ocpolarity & TIMER_MCHCTL2_MCH0FP);
    
            TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0MS);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      multi mode channel mode select (API_ID(0x003AU))
    \param[in]  timer_periph: TIMERx(x=15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=15,16))
    \param[in]  multi_mode_sel: multi mode channel mode selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MCH_MODE_INDEPENDENTLY: multi mode channel work in independently mode
      \arg        TIMER_MCH_MODE_COMPLEMENTARY: multi mode channel work in complementary output mode
    \param[out] none
    \retval     none
*/
void timer_multi_mode_channel_mode_config(uint32_t timer_periph, uint32_t channel, uint32_t multi_mode_sel)
{
    uint32_t reg;
    reg = TIMER_CTL2(timer_periph);

