wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
    reg &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << (((channel & 0xFU) << 1U) + 20U)));
    reg |= (uint32_t)((multi_mode_sel & TIMER_MCH_MODE_MASK) << (((channel & 0xFU) << 1U) + 20U));

    TIMER_CTL2(timer_periph) = reg;
}

/*!
    \brief      select TIMER input trigger source (API_ID(0x003BU))
    \param[in]  timer_periph: TIMERx(x=0..4,7,15,16)
    \param[in]  intrigger:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_NONE: event mode disable(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered channel 0 input(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered channel 1 input(TIMERx(x=0..4,7,15,16))
      \arg        TIMER_SMCFG_TRGSEL_ETIFP: filtered external trigger input(TIMERx(x=0..4,7))
      \arg        TIMER_SMCFG_TRGSEL_CI2FE2: filtered channel 2 input(TIMERx(x=0..4,7))
      \arg        TIMER_SMCFG_TRGSEL_CI3FE3: filtered channel 3 input(TIMERx(x=0..4,7))
      \arg        TIMER_SMCFG_TRGSEL_MCI0FEM0: filtered multi mode channel 0 input(TIMERx(x=15,16))
      \arg        TIMER_SMCFG_TRGSEL_ITI14: internal trigger 14(TIMERx(x=15,16))
    \param[out] none
    \retval     none
*/
void timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger)
{
    uint8_t timerx_temp = 0U;
    uint32_t timer_base_addr = 0U;
    uint32_t reg_temp;
    uint32_t i = 0U;
    uint32_t j = 0U;
    uint32_t j_temp = 0U;
    uint32_t TIMERxCFG0_value, TIMERxCFG1_value, TIMERxCFG2_value;

    switch(timer_periph){
    case TIMER0:
        timerx_temp = SYSCFG_TIMER0;
        break;
    case TIMER1:
        timerx_temp = SYSCFG_TIMER1;
        break;
    case TIMER2:
        timerx_temp = SYSCFG_TIMER2;
        break;
    case TIMER3:
        timerx_temp = SYSCFG_TIMER3;
        break;
    case TIMER4:
        timerx_temp = SYSCFG_TIMER4;
        break;
    case TIMER7:
        timerx_temp = SYSCFG_TIMER7;
        break;
    case TIMER15:
        timerx_temp = SYSCFG_TIMER15;
        break;
    case TIMER16:
        timerx_temp = SYSCFG_TIMER16;
        break;
    default:
          break;
    }

    timer_base_addr = SYSCFG_TIMERCFG(timerx_temp);

    /* read SYSCFG_TIMERCFG0 register value */
    TIMERxCFG0_value = REG32(timer_base_addr) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG1 register value */
    TIMERxCFG1_value = REG32(timer_base_addr + 4U) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG2 register value */
    TIMERxCFG2_value = REG32(timer_base_addr + 8U) & 0x7FFF7FFFU;

    if((0U == TIMERxCFG0_value) && (0U == TIMERxCFG1_value) && (0U == TIMERxCFG2_value)) {
        REG32(timer_base_addr + 8U) = (uint32_t)(intrigger & TIMER_SMCFG_TRGSEL_MASK) << 16U;
    } else {
        for(i = 0U; i < 0x0CU; i += 4U) {
            if((REG32(timer_base_addr + i) & 0x7FFF7FFFU) != 0x00000000U) {
                j = 0U;
                reg_temp = REG32(timer_base_addr + i) & 0x7FFFU;
                if(0U == reg_temp) {
                    j = 16U;
                    reg_temp = (REG32(timer_base_addr + i) & 0x7FFF0000U);
                }
                j_temp = j;
                for(j = j_temp; j < 31U; j += 5U) {
                    if(reg_temp & (0x1FU << j)) {
                    REG32(timer_base_addr + i) = (uint32_t)(intrigger & TIMER_SMCFG_TRGSEL_MASK) << j;
                    break;
                    }
                }

                break;
            }
        }
    }
}


/*!
    \brief      select TIMER master mode output trigger source (API_ID(0x003CU))
    \param[in]  timer_periph: TIMERx(x=0,7,1,2,3,4,5,6,15,16)
    \param[in]  outrigger: 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT_SRC_RESET: the UPG bit as trigger output (TIMERx(x=0,7,1,2,3,4,5,6,15,16))
      \arg        TIMER_TRI_OUT_SRC_ENABLE: the counter enable signal TIMER_CTL0_CEN as trigger output(TIMERx(x=0,7,1,2,3,4,5,6,15,16))
      \arg        TIMER_TRI_OUT_SRC_UPDATE: update event as trigger output(TIMERx(x=0,7,1,2,3,4,5,6,15,16))
      \arg        TIMER_TRI_OUT_SRC_CH0: a capture or a compare match occurred in channal0 as trigger output TRGO(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_TRI_OUT_SRC_O0CPRE: O0CPRE as trigger output(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_TRI_OUT_SRC_O1CPRE: O1CPRE as trigger output(TIMERx(x=0,7,1,2,3,4,15,16))
      \arg        TIMER_TRI_OUT_SRC_O2CPRE: O2CPRE as trigger output(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_TRI_OUT_SRC_O3CPRE: O3CPRE as trigger output(TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_TRI_OUT_SRC_DECODER_CLOCK: decoder clock as trigger output (TIMERx(x=0,7,1,2,3,4))
      \arg        TIMER_TRI_OUT_SRC_SYNC: synchronization event as trigger output (TIMERx(x=0,7,15,16))
    \param[out] none
    \retval     none
*/
void timer_master_output_trigger_source_select(uint32_t timer_periph, uint32_t outrigger)
{
    uint32_t reg;

    reg  = TIMER_CTL1(timer_periph);
    reg &= (~(uint32_t)TIMER_CTL1_MMC);
    reg |= (uint32_t)(outrigger & TIMER_CTL1_MMC);
    TIMER_CTL1(timer_periph) = reg;
}

/*!
    \brief      select TIMER slave mode (API_ID(0x003DU))
    \param[in]  timer_periph: TIMERx(x=0..4,7,15,16)
    \param[in]  slavemode:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SLAVE_MODE_DISABLE: slave mode disable(TIMERx(x=0~4,7,15,16))
      \arg        TIMER_QUAD_DECODER_MODE0: quadrature decoder mode 0(TIMERx(x=0~4,7))
      \arg        TIMER_QUAD_DECODER_MODE1: quadrature decoder mode 1(TIMERx(x=0~4,7))
      \arg        TIMER_QUAD_DECODER_MODE2: quadrature decoder mode 2(TIMERx(x=0~4,7))
      \arg        TIMER_SLAVE_MODE_RESTART: restart mode(TIMERx(x=0~4,7,15,16))
      \arg        TIMER_SLAVE_MODE_PAUSE: pause mode(TIMERx(x=0~4,7,15,16))
      \arg        TIMER_SLAVE_MODE_EVENT: event mode(TIMERx(x=0~4,7,15,16))
      \arg        TIMER_SLAVE_MODE_EXTERNAL0: external clock mode 0(TIMERx(x=0~4,7,15,16))
      \arg        TIMER_DECODER_MODE0: decoder mode 0(TIMERx(x=1~4))
      \arg        TIMER_DECODER_MODE1: decoder mode 1(TIMERx(x=1~4))
      \arg        TIMER_DECODER_MODE2: decoder mode 2(TIMERx(x=1~4))
      \arg        TIMER_DECODER_MODE3: decoder mode 3(TIMERx(x=1~4))
      \arg        TIMER_QUAD_DECODER_MODE3: quadrature decoder mode 3(TIMERx(x=1~4))
      \arg        TIMER_QUAD_DECODER_MODE4: quadrature decoder mode 4(TIMERx(x=1~4))
    \param[out] none
    \retval     none
*/

void timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode)
{
    uint32_t timerx_temp = 0U;
    uint32_t timerxcfg_addr = 0U;
    uint32_t timer_base_addr = 0U;
    uint32_t trigger_temp = 0U;
    uint32_t trigger_off = 0U;
    uint32_t reg_temp;
    uint32_t i = 0U;
    uint32_t j = 0U;
    uint32_t TIMERxCFG0_value, TIMERxCFG1_value, TIMERxCFG2_value;

