wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 8U));
        reg |= (uint32_t)(((uint32_t)pulsesel & TIMER_PULSE_OUTPUT_MASK) << 8U);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 10U));
        reg |= (uint32_t)(((uint32_t)pulsesel & TIMER_PULSE_OUTPUT_MASK) << 10U);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 12U));
        reg |= (uint32_t)(((uint32_t)pulsesel & TIMER_PULSE_OUTPUT_MASK) << 12U);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        reg &= (~(uint32_t)((uint32_t)TIMER_PULSE_OUTPUT_MASK << 14U));
        reg |= (uint32_t)(((uint32_t)pulsesel & TIMER_PULSE_OUTPUT_MASK) << 14U);
        break;
    default:
        break;
    }
    TIMER_CTL2(timer_periph) = reg;
}

/*!
    \brief      configure the TIMER composite PWM mode (API_ID(0x004CU))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_composite_pwm_mode_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_CH0CPWMEN << channel);
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_CH0CPWMEN << channel));
    }
}

/*!
    \brief      configure the TIMER composite PWM mode output pulse value (API_ID(0x004DU))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  pulse: channel compare value, 0~65535
    \param[in]  add_pulse: channel additional compare value, 0~65535
    \param[out] none
    \retval     none
*/
void timer_channel_composite_pwm_mode_output_pulse_value_config(uint32_t timer_periph, uint32_t channel, uint32_t pulse, uint32_t add_pulse)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CH0CV(timer_periph) = (uint32_t)pulse;
        TIMER_CH0COMV_ADD(timer_periph) = (uint32_t)add_pulse;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CH1CV(timer_periph) = (uint32_t)pulse;
        TIMER_CH1COMV_ADD(timer_periph) = (uint32_t)add_pulse;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CH2CV(timer_periph) = (uint32_t)pulse;
        TIMER_CH2COMV_ADD(timer_periph) = (uint32_t)add_pulse;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CH3CV(timer_periph) = (uint32_t)pulse;
        TIMER_CH3COMV_ADD(timer_periph) = (uint32_t)add_pulse;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the TIMER asymmetric PWM mode output pulse value (API_ID(0x004EU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  pulse: channel compare value, 0~65535
    \param[in]  add_pulse: channel additional compare value, 0~65535
    \param[out] none
    \retval     none
*/
void timer_channel_asymmetric_pwm_pulse_config(uint32_t timer_periph, uint32_t channel, uint32_t pulse, uint32_t add_pulse)
{
    switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CH0CV(timer_periph) = (uint32_t)pulse;
            TIMER_CH0COMV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CH1CV(timer_periph) = (uint32_t)pulse;
            TIMER_CH1COMV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CH2CV(timer_periph) = (uint32_t)pulse;
            TIMER_CH2COMV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CH3CV(timer_periph) = (uint32_t)pulse;
            TIMER_CH3COMV_ADD(timer_periph) = (uint32_t)add_pulse;
            break;
        default:
            break;
    }
}


/*!
    \brief      configure TIMER channel additional compare value (API_ID(0x004FU))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  value: channel additional compare value, 0~65535
    \param[out] none
    \retval     none
*/
void timer_channel_additional_compare_value_config(uint32_t timer_periph, uint16_t channel, uint32_t value)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CH0COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CH1COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CH2COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CH3COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    default:
        break;
    }
}

/*!
    \brief      select TIMER channel additional output register update source (API_ID(0x0050U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  update: channel additional output register update
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ADD_UPDATE_BY_UPDATE: channel additional compare value register update by update event
      \arg        TIMER_ADD_UPDATE_BY_COM_MATCH: channel additional compare value register update by compare value match event
    \param[out] none
    \retval     none
*/
void timer_channel_additional_output_update_select(uint32_t timer_periph, uint16_t channel, uint16_t update)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0ADDUPS);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)update << 26U) & TIMER_CHCTL0_CH0ADDUPS);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1ADDUPS);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)update << 27U) & TIMER_CHCTL0_CH1ADDUPS);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2ADDUPS);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)update << 26U) & TIMER_CHCTL1_CH2ADDUPS);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3ADDUPS);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)update << 27U) & TIMER_CHCTL1_CH3ADDUPS);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel additional output shadow function (API_ID(0x0051U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7,))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  aocshadow: channel additional output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ADD_SHADOW_ENABLE: channel additional compare output shadow enable
      \arg        TIMER_ADD_SHADOW_DISABLE: channel additional compare output shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_additional_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t aocshadow)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMADDSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)aocshadow << 28U) & TIMER_CHCTL0_CH0COMADDSEN);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMADDSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)(((uint32_t)aocshadow << 29U) & TIMER_CHCTL0_CH1COMADDSEN);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMADDSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)aocshadow << 28U) & TIMER_CHCTL1_CH2COMADDSEN);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMADDSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)(((uint32_t)aocshadow << 29U) & TIMER_CHCTL1_CH3COMADDSEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      read TIMER channel additional compare value (API_ID(0x0052U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7,15,16))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[out] none
    \retval     value: channel additional compare value, 0~65535
*/
uint32_t timer_channel_additional_compare_value_read(uint32_t timer_periph, uint16_t channel)
{
    uint32_t value = 0U;
    switch(channel) {
    case TIMER_CH_0:
        /* read CH0COMV_ADD value */
        value = TIMER_CH0COMV_ADD(timer_periph);
        break;
    case TIMER_CH_1:
        /* read CH1COMV_ADD value */
        value = TIMER_CH1COMV_ADD(timer_periph);
        break;
    case TIMER_CH_2:
        /* read CH2COMV_ADD value */
        value = TIMER_CH2COMV_ADD(timer_periph);
        break;
    case TIMER_CH_3:
        /* read CH3COMV_ADD value */
        value = TIMER_CH3COMV_ADD(timer_periph);
        break;
    default:
        break;
    }
    return value;
}

/*!
    \brief      configure the TIMER break source (API_ID(0x0053U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  break_src: break source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN0: BRKIN0 alternate function input enable, TIMERx(x=0,7,15,16)
      \arg        TIMER_BRKCMP0: CMP0 input enable, TIMERx(x=0,7,15,16)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_external_source_config(uint32_t timer_periph, uint32_t break_src, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_AFCTL0(timer_periph) |= (break_src & TIMER_BREAK_SOURCE_MASK);
    } else {
        TIMER_AFCTL0(timer_periph) &= (~(break_src & TIMER_BREAK_SOURCE_MASK));
    }
}

/*!
    \brief      configure TIMER break polarity (API_ID(0x0054U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  break_src: break source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN0: BRKIN0 alternate function input enable, TIMERx(x=0,7,15,16)
      \arg        TIMER_BRKCMP0: CMP0 input enable, TIMERx(x=0,7,15,16)
    \param[in]  bkinpolarity: break polarity
                only one parameter can be selected which is shown as below:
                  TIMER_BRKIN_POLARITY_LOW: input signal will not be inverted
                  TIMER_BRKIN_POLARITY_HIGH: input signal will be inverted
    \param[out] none
    \retval     none
*/
void timer_break_external_polarity_config(uint32_t timer_periph, uint32_t break_src, uint16_t bkinpolarity)
{
    switch(break_src) {
        case TIMER_BRKIN0:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN0P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 16U) & TIMER_BRKIN0P);
            break;
        case TIMER_BRKCMP0:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP0P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 25U) & TIMER_BRKCMP0P);
            break;
        default:
        break;
    }
}

/*!
    \brief      configure the TIMER falling edge dead time (API_ID(0x0055U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  deadtime: 0~255
    \param[out] none
    \retval     none
*/
void timer_dead_time_falling_edge_config(uint32_t timer_periph, uint32_t deadtime)
{
    TIMER_CCHP1(timer_periph) &= (~(uint32_t)TIMER_CCHP1_DTFCFG);
    TIMER_CCHP1(timer_periph) |= (uint32_t)(((uint32_t)deadtime) & TIMER_CCHP1_DTFCFG);
}

/*!
    \brief      configure the TIMER dead time different function (API_ID(0x0056U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_dead_time_different_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CCHP1(timer_periph) |= (uint32_t)TIMER_CCHP1_DTDIFEN;
    } else {
        TIMER_CCHP1(timer_periph) &= (~(uint32_t)TIMER_CCHP1_DTDIFEN);
    }
}


/*!
    \brief      configure the TIMER channel break function (API_ID(0x0057U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_break_control_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_BRKENCH0 << (channel & TIMER_CHANNEL_MASK));
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_BRKENCH0 << (channel & TIMER_CHANNEL_MASK)));
    }
}

/*!
    \brief      configure the TIMER channel free dead time function (API_ID(0x0058U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_dead_time_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_DTIENCH0 << (channel & TIMER_CHANNEL_MASK));
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_DTIENCH0 << (channel & TIMER_CHANNEL_MASK)));
    }
}


/*!
    \brief      configure the TIMER channel break (API_ID(0x0059U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  breaken: TIMER channel break enable
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_BREAK_ENABLE: channel BREAK input signal enable
      \arg        TIMER_CH_BREAK_DISABLE: channel BREAK input signal disable
    \param[in] breakpolarity: channel BREAK input signal polarity
      \arg        TIMER_CH_BREAK_POLARITY_HIGH: channel BREAK input active high
      \arg        TIMER_CH_BREAK_POLARITY_LOW: channel BREAK input active low
    \param[in] breakfilter: 0~15
    \param[out] none
    \retval     none
*/
void timer_channel_break_config(uint32_t timer_periph, uint32_t breaken, uint32_t breakpolarity, uint32_t breakfilter)
{
    TIMER_CCHP0(timer_periph) &= (~(uint32_t)(TIMER_CCHP0_CHBRKEN | TIMER_CCHP0_CHBRKP | TIMER_CCHP0_BRKF));
    TIMER_CCHP0(timer_periph) |= (uint32_t)((breaken & TIMER_CCHP0_CHBRKEN) | (breakpolarity & TIMER_CCHP0_CHBRKP)| ((breakfilter << 16U) & TIMER_CCHP0_BRKF));
}

/*!
    \brief      configure TIMER channel break external input enable (API_ID(0x005AU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_break_external_status_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    switch(channel) {
    case TIMER_CH_0:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH0BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH0BRKINEN);
        }
        break;
    case TIMER_CH_1:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH1BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH1BRKINEN);
        }
        break;
    case TIMER_CH_2:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH2BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH2BRKINEN);
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel break external input polarity (API_ID(0x005BU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
    \param[in]  bkinpolarity: channel x BREAK input signal polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CHx_BREAK_IN_INV: channel x BREAK input signal will be inverted
      \arg        TIMER_CHx_BREAK_IN_NOT_INV: channel x BREAK input signal will not be inverted
    \param[out] none
    \retval     none
*/
void timer_channel_break_external_polarity_config(uint32_t timer_periph, uint32_t channel, uint16_t bkinpolarity)
{
    switch(channel) {
    case TIMER_CH_0:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH0BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH0BRKINP);
        }
        break;
    case TIMER_CH_1:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH1BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH1BRKINP);
        }
        break;
    case TIMER_CH_2:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH2BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH2BRKINP);
        }
        break;
    default:
        break;
    }
}



/*!
    \brief      configure TIMER channel primary output function (API_ID(0x005CU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_primary_output_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    switch(channel) {
    case TIMER_CH_0:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN0;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN0);
        }
        break;
    case TIMER_CH_1:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN1;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN1);
        }
        break;
    case TIMER_CH_2:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN2;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN2);
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel break period value (API_ID(0x005DU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  value: channel break period value, 0~0xFFFF
    \param[out] none
    \retval     none
*/
void timer_channel_break_period_config(uint32_t timer_periph, uint16_t value)
{
    TIMER_CHBRKPER(timer_periph) = (uint32_t)value;
}


/*!
    \brief      configure quadrature decoder signal disconnection detection watchdog value (API_ID(0x005EU))
    \param[in]  timer_periph: TIMERx(x=1~4)
    \param[in]  value: watchdog counter period value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_watchdog_value_config(uint32_t timer_periph, uint32_t value)
{
    TIMER_WDGPER(timer_periph) = value;
}

/*!
    \brief      read quadrature decoder signal disconnection detection watchdog value (API_ID(0x005FU))
    \param[in]  timer_periph: TIMERx(x=1~4)
    \param[out] none
    \retval     watchdog counter period register value, 0~0xFFFFFFFF
*/
uint32_t timer_watchdog_value_read(uint32_t timer_periph)
{
    return (TIMER_WDGPER(timer_periph));
}

