wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
/*!
    \brief      configure quadrature decoder signal disconnection detection function (API_ID(0x0060U))
    \param[in]  timer_periph: TIMERx(x=1~4)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_disconnection_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= TIMER_DECDISCONNECTDEN;
    } else {
        TIMER_CTL2(timer_periph) &= (~TIMER_DECDISCONNECTDEN);
    }
}

/*!
    \brief      configure quadrature decoder signal jump detection function (API_ID(0x0061U))
    \param[in]  timer_periph: TIMERx(x=1~4)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_jump_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= TIMER_DECJUMPDEN;
    } else {
        TIMER_CTL2(timer_periph) &= (~TIMER_DECJUMPDEN);
    }
}


/*!
    \brief      configure counter initial value register (API_ID(0x0062U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_counter_initial_register_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CINITCTL(timer_periph) |= TIMER_CINITCTL_CINITVEN;
    } else {
        TIMER_CINITCTL(timer_periph) &= (~(uint32_t)TIMER_CINITCTL_CINITVEN);
    }
}

/*!
    \brief      configure counter initial value and direction (API_ID(0x0063U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[in]  value: counter initial value, 0~0xFFFF
    \param[in]  direction: counter initial direction
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INITIAL_DIRECTION_DOWN: counter count down when synchronization event occurs
      \arg        TIMER_INITIAL_DIRECTION_UP: counter count up when synchronization event occurs
    \param[out] none
    \retval     none
*/
void timer_counter_initial_config(uint32_t timer_periph, uint32_t value, uint32_t direction)
{
    TIMER_CINITV(timer_periph) = (uint32_t)value;

    TIMER_CINITCTL(timer_periph) &= (~(uint32_t)TIMER_CINITCTL_CINITDIR);
    TIMER_CINITCTL(timer_periph) |= (uint32_t)((uint32_t)direction & TIMER_CINITCTL_CINITDIR);
}

/*!
    \brief      generate soft synchronization event (API_ID(0x0064U))
    \param[in]  timer_periph: TIMERx(x=0,7,15,16)
    \param[out] none
    \retval     none
*/
void timer_synchronization_event_generate(uint32_t timer_periph)
{
    TIMER_CINITCTL(timer_periph) |= TIMER_CINITCTL_SWSYNCG;
}

/*!
    \brief      get TIMER flags (API_ID(0x0065U))
    \param[in]  timer_periph: TIMERx(x=0~7,15,16)
    \param[in]  flag: the TIMER flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0~7,15,16)
      \arg        TIMER_FLAG_CH0: channel 0 capture or compare flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_CH1: channel 1 capture or compare flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_CH2: channel 2 capture or compare flag, TIMERx(x=0~4,7)
      \arg        TIMER_FLAG_CH3: channel 3 capture or compare flag, TIMERx(x=0~4,7)
      \arg        TIMER_FLAG_CMT: channel commutation flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_BRK: BREAK flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0~4,7)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0~4,7)
      \arg        TIMER_FLAG_SYSB: system source break flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_DECJ: quadrature decoder signal jump flag, TIMERx(x=1~4)
      \arg        TIMER_FLAG_DECDIS: quadrature decoder signal disconnection flag, TIMERx(x=1~4)
      \arg        TIMER_FLAG_MCH0: multi mode channel 0 capture or compare flag, TIMERx(x=15,16)
      \arg        TIMER_FLAG_MCH0O: multi mode channel 0 overcapture flag, TIMERx(x=15,16)
      \arg        TIMER_FLAG_CH0COMADD: channel 0 additional compare flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_FLAG_CH1COMADD: channel 1 additional compare flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_FLAG_CH2COMADD: channel 2 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH3COMADD: channel 3 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0BRKM: channel 0 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH1BRKM: channel 1 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH2BRKM: channel 2 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0BRK: channel 0 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH1BRK: channel 1 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH2BRK: channel 2 BREAK interrupt flag, TIMERx(x=0,7)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_flag_get(uint32_t timer_periph, uint32_t flag)
{
    FlagStatus timer_flag = RESET;
    
    if(RESET != (TIMER_REG_VAL1(timer_periph, flag) & BIT(TIMER_BIT_POS1(flag)))){
        timer_flag = SET;
    }else{
        timer_flag = RESET;
    }
    
    return timer_flag;
}

/*!
    \brief      clear TIMER flags (API_ID(0x0066U))
    \param[in]  timer_periph: TIMERx(x=0~7,15,16)
    \param[in]  flag: the TIMER flags
                only one parameter can be selected which are shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0~7,15,16)
      \arg        TIMER_FLAG_CH0: channel 0 capture or compare flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_CH1: channel 1 capture or compare flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_CH2: channel 2 capture or compare flag, TIMERx(x=0~4,7)
      \arg        TIMER_FLAG_CH3: channel 3 capture or compare flag, TIMERx(x=0~4,7)
      \arg        TIMER_FLAG_CMT: channel commutation flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_BRK: BREAK flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0~4,7)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0~4,7)
      \arg        TIMER_FLAG_SYSB: system source break flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_DECJ: quadrature decoder signal jump flag, TIMERx(x=1~4)
      \arg        TIMER_FLAG_DECDIS: quadrature decoder signal disconnection flag, TIMERx(x=1~4)
      \arg        TIMER_FLAG_MCH0: multi mode channel 0 capture or compare flag, TIMERx(x=15,16)
      \arg        TIMER_FLAG_MCH0O: multi mode channel 0 overcapture flag, TIMERx(x=15,16)
      \arg        TIMER_FLAG_CH0COMADD: channel 0 additional compare flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_FLAG_CH1COMADD: channel 1 additional compare flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_FLAG_CH2COMADD: channel 2 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH3COMADD: channel 3 additional compare flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0BRKM: channel 0 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH1BRKM: channel 1 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH2BRKM: channel 2 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH0BRK: channel 0 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH1BRK: channel 1 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_FLAG_CH2BRK: channel 2 BREAK interrupt flag, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
    TIMER_REG_VAL1(timer_periph, flag) &= (~(uint32_t)BIT(TIMER_BIT_POS1(flag)));
}

/*!
    \brief      enable the TIMER interrupt (API_ID(0x0067U))
    \param[in]  timer_periph: TIMERx(x=0~7,15,16)
    \param[in]  interrupt: timer interrupt source
                only one parameter can be selected which are shown as below:
      \arg        TIMER_INT_UP: update interrupt, TIMERx(x=0~7,15,16)
      \arg        TIMER_INT_CH0: channel 0 capture or compare interrupt, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_CH1: channel 1 capture or compareinterrupt, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_CH2: channel 2 capture or compare interrupt, TIMERx(x=0~4,7)
      \arg        TIMER_INT_CH3: channel 3 capture or compare interrupt, TIMERx(x=0~4,7)
      \arg        TIMER_INT_CMT: channel commutation interrupt, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_TRG: trigger interrupt, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_BRK: break interrupt, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_DECJ: quadrature decoder signal jump interrupt, TIMERx(x=1~4)
      \arg        TIMER_INT_DECDIS: quadrature decoder signal disconnection interrupt, TIMERx(x=1~4)
      \arg        TIMER_INT_MCH0: multi mode channel 0 capture or compare interrupt, TIMERx(x=15,16)
      \arg        TIMER_INT_CH0COMADD: channel 0 additional compare interrupt, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_CH1COMADD: channel 1 additional compare interrupt, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_CH2COMADD: channel 2 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH3COMADD: channel 3 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH0BRKM: channel 0 BREAK multi-period interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH1BRKM: channel 1 BREAK multi-period interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH2BRKM: channel 2 BREAK multi-period interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH0BRK: channel 0 BREAK interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH1BRK: channel 1 BREAK interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH2BRK: channel 2 BREAK interrupt, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_REG_VAL1(timer_periph, interrupt) |= (uint32_t) BIT(TIMER_BIT_POS1(interrupt));
}

/*!
    \brief      disable the TIMER interrupt (API_ID(0x0068U))
    \param[in]  timer_periph: TIMERx(x=0~7,15,16)
    \param[in]  interrupt: timer interrupt source
                only one parameter can be selected which are shown as below:
      \arg        TIMER_INT_UP: update interrupt, TIMERx(x=0~7,15,16)
      \arg        TIMER_INT_CH0: channel 0 capture or compare interrupt, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_CH1: channel 1 capture or compareinterrupt, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_CH2: channel 2 capture or compare interrupt, TIMERx(x=0~4,7)
      \arg        TIMER_INT_CH3: channel 3 capture or compare interrupt, TIMERx(x=0~4,7)
      \arg        TIMER_INT_CMT: channel commutation interrupt, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_TRG: trigger interrupt, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_BRK: break interrupt, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_DECJ: quadrature decoder signal jump interrupt, TIMERx(x=1~4)
      \arg        TIMER_INT_DECDIS: quadrature decoder signal disconnection interrupt, TIMERx(x=1~4)
      \arg        TIMER_INT_MCH0: multi mode channel 0 capture or compare interrupt, TIMERx(x=15,16)
      \arg        TIMER_INT_CH0COMADD: channel 0 additional compare interrupt, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_CH1COMADD: channel 1 additional compare interrupt, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_CH2COMADD: channel 2 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH3COMADD: channel 3 additional compare interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH0BRKM: channel 0 BREAK multi-period interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH1BRKM: channel 1 BREAK multi-period interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH2BRKM: channel 2 BREAK multi-period interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH0BRK: channel 0 BREAK interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH1BRK: channel 1 BREAK interrupt, TIMERx(x=0,7)
      \arg        TIMER_INT_CH2BRK: channel 2 BREAK interrupt, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_REG_VAL1(timer_periph, interrupt) &= (~(uint32_t)BIT(TIMER_BIT_POS1(interrupt)));
}

/*!
    \brief      get timer interrupt flags (API_ID(0x0069U))
    \param[in]  timer_periph: TIMERx(x=0~7,15,16)
    \param[in]  int_flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0~7,15,16)
      \arg        TIMER_INT_FLAG_CH0: channel 0 capture or compare interrupt flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_FLAG_CH1: channel 1 capture or compare interrupt flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_FLAG_CH2: channel 2 capture or compare interrupt flag, TIMERx(x=0~4,7)
      \arg        TIMER_INT_FLAG_CH3: channel 3 capture or compare interrupt flag, TIMERx(x=0~4,7)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_FLAG_BRK: BREAK interrupt flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_FLAG_SYSB: system source break interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_DECJ: quadrature decoder signal jump interrupt flag, TIMERx(x=1~4)
      \arg        TIMER_INT_FLAG_DECDIS: quadrature decoder signal disconnection interrupt flag, TIMERx(x=1~4)
      \arg        TIMER_INT_FLAG_MCH0: multi mode channel 0 capture or compare interrupt flag, TIMERx(x=15,16)
      \arg        TIMER_INT_FLAG_CH0COMADD: channel 0 additional compare interrupt flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_FLAG_CH1COMADD: channel 1 additional compare interrupt flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_FLAG_CH2COMADD: channel 2 additional compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH3COMADD: channel 3 additional compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH0BRKM: channel 0 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH1BRKM: channel 1 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH2BRKM: channel 2 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH0BRK: channel 0 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH1BRK: channel 1 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH2BRK: channel 2 BREAK interrupt flag, TIMERx(x=0,7)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag)
{
    FlagStatus timer_interrupt_flag = RESET;
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (TIMER_REG_VAL1(timer_periph, int_flag) & BIT(TIMER_BIT_POS1(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (TIMER_REG_VAL2(timer_periph, int_flag) & BIT(TIMER_BIT_POS2(int_flag)));

