wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_timer.c
    if(flagstatus && intenable){
        timer_interrupt_flag =  SET;
    }else{
        timer_interrupt_flag =  RESET;
    }
    
    return timer_interrupt_flag;
}

/*!
    \brief      clear TIMER interrupt flags (API_ID(0x006AU))
    \param[in]  timer_periph: TIMERx(x=0~7,15,16)
    \param[in]  int_flag: the timer interrupt flags
                only one parameter can be selected which are shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0~7,15,16)
      \arg        TIMER_INT_FLAG_CH0: channel 0 capture or compare interrupt flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_FLAG_CH1: channel 1 capture or compare interrupt flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_FLAG_CH2: channel 2 capture or compare interrupt flag, TIMERx(x=0~4,7)
      \arg        TIMER_INT_FLAG_CH3: channel 3 capture or compare interrupt flag, TIMERx(x=0~4,7)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0~4,7,15,16)
      \arg        TIMER_INT_FLAG_BRK: BREAK interrupt flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_FLAG_SYSB: system source break interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_DECJ: quadrature decoder signal jump interrupt flag, TIMERx(x=1~4)
      \arg        TIMER_INT_FLAG_DECDIS: quadrature decoder signal disconnection interrupt flag, TIMERx(x=1~4)
      \arg        TIMER_INT_FLAG_MCH0: multi mode channel 0 capture or compare interrupt flag, TIMERx(x=15,16)
      \arg        TIMER_INT_FLAG_CH0COMADD: channel 0 additional compare interrupt flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_FLAG_CH1COMADD: channel 1 additional compare interrupt flag, TIMERx(x=0,7,15,16)
      \arg        TIMER_INT_FLAG_CH2COMADD: channel 2 additional compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH3COMADD: channel 3 additional compare interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH0BRKM: channel 0 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH1BRKM: channel 1 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH2BRKM: channel 2 BREAK multi-period interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH0BRK: channel 0 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH1BRK: channel 1 BREAK interrupt flag, TIMERx(x=0,7)
      \arg        TIMER_INT_FLAG_CH2BRK: channel 2 BREAK interrupt flag, TIMERx(x=0,7)
    \param[out] none
    \retval     none
*/
void timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t int_flag)
{
    TIMER_REG_VAL2(timer_periph, int_flag) &= (~(uint32_t)BIT(TIMER_BIT_POS2(int_flag)));
}

